# Incredibly fast JavaScript runtime, bundler, test runner, and package manager
brew "bun"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Fast and simple Node.js version manager
brew "fnm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Fast, disk space efficient package manager
brew "pnpm"
# Cross-shell prompt for astronauts
brew "starship"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-pretendard"
cask "font-pretendard-jp"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
